<?php

$langmk['ug_nowrunning1'] = "Нажмите кнопку \"Upgrade\" чтобы обновить базу вашего MKPortal версии";
$langmk['ug_nowrunning2'] = "до версии %1.";
$langmk['ug_title'] = "Обновление MKPORTAL M1.x -> %1";
$langmk['ug_noupgrade'] = "Вы уже используете версию %1. В обновлении нет необходимости.";
$langmk['ug_wrongvers'] = "Ошибка. Версия не соответствует нужной.<br /> Mkportal >= M1.0 необходимая версия, чтобы обновить до версии MKportal %1";
$langmk['ug_nodb'] = "Ошибка соединения с базой данных";
$langmk['ug_noopen'] = "Невозможно открыть или прочитать файл conf_mk.php";
$langmk['ug_nowrite'] = " Запись в файл conf_mk.php невозможна. Проверьте настройки доступа и прав.";
$langmk['ug_succes1'] = "Обновление завершено.";
$langmk['ug_succes2'] = "Убедитесь, что вы произвели все необходимые изменения файлов форума, в соответствии с указаниями  последнего обновления %1 .";
$langmk['ug_succes4'] = "Важно! Незамедлительно удалите папку mkportal/upgrades и файл mk_install.php с вашего сервера в целях обеспечения безопасности.";
$langmk['ug_succes5'] = "Важно! Незамедлительно удалите каталоги aeforum/setup и aeforum/upgrade с вашего сервера в целях обеспечения безопасности.";
$langmk['ug_succes3'] = "Нажмите сюда, чтобы войти в портал.";
$langmk['ug_go'] = "Обновить";


?>